airfoil/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | daehwa001210@gmail.com                          |
|  \    /   O peration     | Made By Daehwa Ko                               |
|   \  /    A nd           |                                                 |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
gemetry
{
}
vertices
(
    (0 0 0) // 0
    (1 0 0) // 1
    (1 12 0) // 2
    (-11 0 0) // 3
    (0 0 0.3) // 4
    (1 0 0.3) // 5
    (1 12 0.3) // 6
    (-11 0 0.3) // 7
    (21 0.0000000000 0) // 8
    (21 12 0) // 9
    (21 0.0000000000 0.3) // 10
    (21 12 0.3) // 11
    (1 -12 0) // 12
    (1 -12 0.3) // 13
    (21 -12 0) // 14
    (21 -12 0.3) // 15
    (1 0 0) // 16
    (1 0 0.3) // 17
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 48 1)  // block 1
    edgeGrading
    (
    // x-direction expansion ratio
    (
        ( 0.400000000 0.512195122 3.500000000 )
        ( 0.600000000 0.487804878 0.857142857 )
     )
    0.030000000 0.030000000
    ( 
        ( 0.400000000 0.512195122 3.500000000 )
        ( 0.600000000 0.487804878 0.857142857 )
     )
    // y-direction expansion ratio
    ( 
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
     )
    ( 
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
     )
    ( 
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
     )
    (
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
     )

    // z-direction expansion ratio
    1 1 1 1
    )
    
    hex ( 1 8 9 2 5 10 11 6 ) ( 74 48 1 )    // block 2
    edgeGrading
    (
    // x-direction expansion ratio
    33.333333333 33.333333333 33.333333333 33.333333333
    // y-direction expansion ratio
    (
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
    )
    13.9581659180 13.9581659180
    ( 
        ( 0.0416666667 0.3541666667 22.1861110674 )
        ( 0.9583333333 0.6458333333 9.0146488221 )
    )

    // z-direction expansion ratio
    1 1 1 1
    ) 

    hex ( 3 12 16 0 7 13 17 4 ) ( 41 48 1 )    // block 3
    edgeGrading
    ( 
    // x-direction expansion ratio
    0.030000000
    ( 
        ( 0.4000000000 0.5121951220 3.5000000000 )
        ( 0.6000000000 0.4878048780 0.8571428571 )
    )
    (
        ( 0.4000000000 0.5121951220 3.5000000000 )
        ( 0.6000000000 0.4878048780 0.8571428571 )
    )
    0.030000000
    // y-direction expansion ratio
    (
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
    )
    ( 
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
    )
    ( 
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
    )
    ( 
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
    )

    // z-direction expansion ratio
    1 1 1 1
    )

    hex ( 12 14 8 16 13 15 10 17 ) ( 74 48 1 )    // block 4
    edgeGrading
    (
    // x-direction expansion ratio
    33.333333333 33.333333333 33.333333333 33.333333333
    // y-direction expansion ratio
    (
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
     )
    0.0716426503 0.0716426503
    ( 
        ( 0.9583333333 0.6458333333 0.1109305553 )
        ( 0.0416666667 0.3541666667 0.0450732441 )
    )
    // z-direction expansion ratio
    1 1 1 1
    )
);

edges
(
    arc 3 2 ( -7.485281374 8.485281374 0 )
    arc 7 6 ( -7.485281374 8.485281374 0.3 )

    spline 1 0
    (
    (	0.973529	0.006171	0	)
(	0.947059	0.011525	0	)
(	0.920588	0.016879	0	)
(	0.894118	0.022233	0	)
(	0.867647	0.027587	0	)
(	0.841176	0.032941	0	)
(	0.814706	0.038294	0	)
(	0.788235	0.043648	0	)
(	0.761765	0.049002	0	)
(	0.735294	0.054356	0	)
(	0.708824	0.059710	0	)
(	0.682353	0.065064	0	)
(	0.655882	0.070418	0	)
(	0.629412	0.075772	0	)
(	0.602941	0.081126	0	)
(	0.576471	0.086479	0	)
(	0.550000	0.091833	0	)
(	0.523529	0.097187	0	)
(	0.497059	0.101913	0	)
(	0.470588	0.106387	0	)
(	0.444118	0.110861	0	)
(	0.417647	0.115336	0	)
(	0.391176	0.119810	0	)
(	0.364706	0.124284	0	)
(	0.338235	0.128758	0	)
(	0.311765	0.133233	0	)
(	0.285294	0.137707	0	)
(	0.258824	0.142181	0	)
(	0.232353	0.146655	0	)
(	0.205882	0.149819	0	)
(	0.179412	0.148307	0	)
(	0.152941	0.142179	0	)
(	0.126471	0.130598	0	)
(	0.100000	0.115333	0	)
(	0.061054	0.092874	0	)
(	0.037276	0.077621	0	)
(	0.022758	0.063353	0	)
(	0.013895	0.050476	0	)
(	0.008483	0.039882	0	)
(	0.005179	0.031721	0	)
(	0.003162	0.024143	0	)
(	0.001931	0.019446	0	)
(	0.001179	0.013956	0	)
(	0.000720	0.010395	0	)
(	0.000439	0.008221	0	)
(	0.000268	0.006894	0	)
(	0.000164	0.005108	0	)
(	0.000100	0.003118	0	)
    )

    spline 5 4
    (
    (	0.973529	0.006171	0.3	)
(	0.947059	0.011525	0.3	)
(	0.920588	0.016879	0.3	)
(	0.894118	0.022233	0.3	)
(	0.867647	0.027587	0.3	)
(	0.841176	0.032941	0.3	)
(	0.814706	0.038294	0.3	)
(	0.788235	0.043648	0.3	)
(	0.761765	0.049002	0.3	)
(	0.735294	0.054356	0.3	)
(	0.708824	0.059710	0.3	)
(	0.682353	0.065064	0.3	)
(	0.655882	0.070418	0.3	)
(	0.629412	0.075772	0.3	)
(	0.602941	0.081126	0.3	)
(	0.576471	0.086479	0.3	)
(	0.550000	0.091833	0.3	)
(	0.523529	0.097187	0.3	)
(	0.497059	0.101913	0.3	)
(	0.470588	0.106387	0.3	)
(	0.444118	0.110861	0.3	)
(	0.417647	0.115336	0.3	)
(	0.391176	0.119810	0.3	)
(	0.364706	0.124284	0.3	)
(	0.338235	0.128758	0.3	)
(	0.311765	0.133233	0.3	)
(	0.285294	0.137707	0.3	)
(	0.258824	0.142181	0.3	)
(	0.232353	0.146655	0.3	)
(	0.205882	0.149819	0.3	)
(	0.179412	0.148307	0.3	)
(	0.152941	0.142179	0.3	)
(	0.126471	0.130598	0.3	)
(	0.100000	0.115333	0.3	)
(	0.061054	0.092874	0.3	)
(	0.037276	0.077621	0.3	)
(	0.022758	0.063353	0.3	)
(	0.013895	0.050476	0.3	)
(	0.008483	0.039882	0.3	)
(	0.005179	0.031721	0.3	)
(	0.003162	0.024143	0.3	)
(	0.001931	0.019446	0.3	)
(	0.001179	0.013956	0.3	)
(	0.000720	0.010395	0.3	)
(	0.000439	0.008221	0.3	)
(	0.000268	0.006894	0.3	)
(	0.000164	0.005108	0.3	)
(	0.000100	0.003118	0.3	)
    )
    
    arc 3 12 ( -7.485281374 -8.485281374 0 )
    arc 7 13 ( -7.485281374 -8.485281374 0.3 )

    spline 0 16
    (
    (	0.000100	-0.003118	0	)
(	0.000164	-0.005108	0	)
(	0.000268	-0.006894	0	)
(	0.000439	-0.008221	0	)
(	0.000720	-0.010395	0	)
(	0.001179	-0.013956	0	)
(	0.001931	-0.019446	0	)
(	0.003162	-0.024143	0	)
(	0.005179	-0.031721	0	)
(	0.008483	-0.039882	0	)
(	0.013895	-0.050476	0	)
(	0.022758	-0.063353	0	)
(	0.037276	-0.077621	0	)
(	0.061054	-0.092874	0	)
(	0.100000	-0.115333	0	)
(	0.126471	-0.130598	0	)
(	0.152941	-0.142179	0	)
(	0.179412	-0.148307	0	)
(	0.205882	-0.149819	0	)
(	0.232353	-0.146655	0	)
(	0.258824	-0.142181	0	)
(	0.285294	-0.137707	0	)
(	0.311765	-0.133233	0	)
(	0.338235	-0.128758	0	)
(	0.364706	-0.124284	0	)
(	0.391176	-0.119810	0	)
(	0.417647	-0.115336	0	)
(	0.444118	-0.110861	0	)
(	0.470588	-0.106387	0	)
(	0.497059	-0.101913	0	)
(	0.523529	-0.097187	0	)
(	0.550000	-0.091833	0	)
(	0.576471	-0.086479	0	)
(	0.602941	-0.081126	0	)
(	0.629412	-0.075772	0	)
(	0.655882	-0.070418	0	)
(	0.682353	-0.065064	0	)
(	0.708824	-0.059710	0	)
(	0.735294	-0.054356	0	)
(	0.761765	-0.049002	0	)
(	0.788235	-0.043648	0	)
(	0.814706	-0.038294	0	)
(	0.841176	-0.032941	0	)
(	0.867647	-0.027587	0	)
(	0.894118	-0.022233	0	)
(	0.920588	-0.016879	0	)
(	0.947059	-0.011525	0	)
(	0.973529	-0.006171	0	)
    )
    
    spline 4 17
    (
    (	0.000100	-0.003118	0.3	)
(	0.000164	-0.005108	0.3	)
(	0.000268	-0.006894	0.3	)
(	0.000439	-0.008221	0.3	)
(	0.000720	-0.010395	0.3	)
(	0.001179	-0.013956	0.3	)
(	0.001931	-0.019446	0.3	)
(	0.003162	-0.024143	0.3	)
(	0.005179	-0.031721	0.3	)
(	0.008483	-0.039882	0.3	)
(	0.013895	-0.050476	0.3	)
(	0.022758	-0.063353	0.3	)
(	0.037276	-0.077621	0.3	)
(	0.061054	-0.092874	0.3	)
(	0.100000	-0.115333	0.3	)
(	0.126471	-0.130598	0.3	)
(	0.152941	-0.142179	0.3	)
(	0.179412	-0.148307	0.3	)
(	0.205882	-0.149819	0.3	)
(	0.232353	-0.146655	0.3	)
(	0.258824	-0.142181	0.3	)
(	0.285294	-0.137707	0.3	)
(	0.311765	-0.133233	0.3	)
(	0.338235	-0.128758	0.3	)
(	0.364706	-0.124284	0.3	)
(	0.391176	-0.119810	0.3	)
(	0.417647	-0.115336	0.3	)
(	0.444118	-0.110861	0.3	)
(	0.470588	-0.106387	0.3	)
(	0.497059	-0.101913	0.3	)
(	0.523529	-0.097187	0.3	)
(	0.550000	-0.091833	0.3	)
(	0.576471	-0.086479	0.3	)
(	0.602941	-0.081126	0.3	)
(	0.629412	-0.075772	0.3	)
(	0.655882	-0.070418	0.3	)
(	0.682353	-0.065064	0.3	)
(	0.708824	-0.059710	0.3	)
(	0.735294	-0.054356	0.3	)
(	0.761765	-0.049002	0.3	)
(	0.788235	-0.043648	0.3	)
(	0.814706	-0.038294	0.3	)
(	0.841176	-0.032941	0.3	)
(	0.867647	-0.027587	0.3	)
(	0.894118	-0.022233	0.3	)
(	0.920588	-0.016879	0.3	)
(	0.947059	-0.011525	0.3	)
(	0.973529	-0.006171	0.3	)
    )
);

faces
( 

);

faces
( 

);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
( 
inlet              // patch name
        {
            type patch; 
            faces
            ( 
                ( 9 2 6 11 )  
                ( 2 3 7 6 )  
                ( 3 12 13 7 )
                ( 12 15 14 13 )
            );
        }

outlet              // patch name
        {
            type patch;    
            faces
            ( 
                ( 8 9 10 11 )  
                ( 15 8 10 14 ) 
            );
        }

walls              // patch name
        {
            type wall; 
            faces
            ( 
                ( 0 1 5 4 )  
                ( 0 4 17 16 ) 
            );
        }

interface1              // patch name
        {
            type patch;   
            faces
            ( 
                ( 1 8 10 5 )  
            );
        }
interface2              // patch name
        {
            type patch;    
            faces
            ( 
                ( 16 17 10 8 )  
            );
        }
);

mergePatchPairs
( 
    ( interface1 interface2 )
);
// ************************************************************************* //					

